Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_НастройкиМетаданныхПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция СоответствиеТаблицИнтеграцииВКонфигурации() Экспорт
	
	СоответствиеТаблиц = Новый Соответствие();
	
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Контрагенты, 
		Метаданные.РегистрыСведений.SUI_tbl_countragents.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Склады, 
		Метаданные.РегистрыСведений.SUI_tbl_warehouses.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Ячейки, 
		Метаданные.РегистрыСведений.SUI_tbl_cells.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура, 
		Метаданные.РегистрыСведений.SUI_tbl_goods.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры, 
		Метаданные.РегистрыСведений.SUI_tbl_properties.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры, 
		Метаданные.РегистрыСведений.SUI_tbl_units.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения, 
		Метаданные.РегистрыСведений.SUI_tbl_classifier_units.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ВидыНоменклатуры, 
		Метаданные.РегистрыСведений.SUI_tbl_types_goods.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, 
		Метаданные.РегистрыСведений.SUI_tbl_barcodes.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Документы, 
		Метаданные.Документы.SUI_ДокументОбмена.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов, 
		Метаданные.Справочники.SUI_НастройкиДокументовОбмена.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток,
		Метаданные.РегистрыСведений.SUI_tbl_label_templates.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД,
		Метаданные.Справочники.SUI_ПользователиТСД.ПолноеИмя());
	СоответствиеТаблиц.Вставить(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения(),
		Метаданные.РегистрыСведений.SUI_СообщенияМобильныхУстройств.ПолноеИмя());
	
	Возврат Новый ФиксированноеСоответствие(СоответствиеТаблиц);
	
КонецФункции

Функция СоответсвиеКонстантТаблицИнтеграции() Экспорт

	СоответсвиеКонстант = Новый Соответствие();
	
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Контрагенты, 
		Константы.SUI_ИспользоватьТаблицу_Контрагенты);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Склады, 
		Константы.SUI_ИспользоватьТаблицу_Склады);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Ячейки, 
		Константы.SUI_ИспользоватьТаблицу_Ячейки);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура, 
		Константы.SUI_ИспользоватьТаблицу_Номенклатура);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры, 
		Константы.SUI_ИспользоватьТаблицу_ХарактеристикиНоменклатуры);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры, 
		Константы.SUI_ИспользоватьТаблицу_УпаковкиНоменклатуры);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения, 
		Константы.SUI_ИспользоватьТаблицу_ЕдиницыИзмерения);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ВидыНоменклатуры, 
		Константы.SUI_ИспользоватьТаблицу_ВидыНоменклатуры);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, 
		Константы.SUI_ИспользоватьТаблицу_ШтрихкодыНоменклатуры);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, 
		Константы.SUI_ИспользоватьТаблицу_ШаблоныЭтикеток);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД, 
		Константы.SUI_ИспользоватьТаблицу_ПользователиТСД);
	
	Возврат Новый ФиксированноеСоответствие(СоответсвиеКонстант);
	
КонецФункции

Функция СоответсвиеФункциональныхОпцийТаблицИнтеграции() Экспорт
	
	СоответсвиеФункциональныхОпций = Новый Соответствие();
	
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Контрагенты, 
		"SUI_ИспользоватьТаблицу_Контрагенты");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Склады, 
		"SUI_ИспользоватьТаблицу_Склады");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Ячейки, 
		"SUI_ИспользоватьТаблицу_Ячейки");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура, 
		"SUI_ИспользоватьТаблицу_Номенклатура");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры, 
		"SUI_ИспользоватьТаблицу_ХарактеристикиНоменклатуры");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры, 
		"SUI_ИспользоватьТаблицу_УпаковкиНоменклатуры");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения, 
		"SUI_ИспользоватьТаблицу_ЕдиницыИзмерения");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ВидыНоменклатуры, 
		"SUI_ИспользоватьТаблицу_ВидыНоменклатуры");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, 
		"SUI_ИспользоватьТаблицу_ШтрихкодыНоменклатуры");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, 
		"SUI_ИспользоватьТаблицу_ШаблоныЭтикеток");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД, 
		"SUI_ИспользоватьТаблицу_ПользователиТСД");
	
	Возврат Новый ФиксированноеСоответствие(СоответсвиеФункциональныхОпций);
	
КонецФункции

Функция ТаблицыИнтеграции() Экспорт
	
	ТаблицыИнтеграции = Новый СписокЗначений();

	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.Контрагенты, 
		Перечисления.SUI_ТаблицыИнтеграции.Контрагенты);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.Склады, 
		Перечисления.SUI_ТаблицыИнтеграции.Склады);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.Ячейки, 
		Перечисления.SUI_ТаблицыИнтеграции.Ячейки);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура, 
		Перечисления.SUI_ТаблицыИнтеграции.Номенклатура);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры, 
		Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры, 
		Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения,
		Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ВидыНоменклатуры, 
		Перечисления.SUI_ТаблицыИнтеграции.ВидыНоменклатуры);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, 
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, 
		Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок, 
		Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры, 
		Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток);
	// TODO: Сандалов: Временное отключениеВременно убрать до реализации авторизации на ТСД	
	//ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД, 
	//	Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД);
		
	Возврат ТаблицыИнтеграции;

КонецФункции

Функция ТаблицыИнтеграцииВКонфигурации() Экспорт
	
	Таблицы = Новый Массив();
	
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_countragents.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_warehouses.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_cells.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_goods.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_properties.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_units.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_classifier_units.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_types_goods.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_barcodes.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_label_templates.ПолноеИмя());
	
	Возврат Новый ФиксированныйМассив(Таблицы);
	
КонецФункции

#КонецОбласти
